{
	"tile1": {
		"tileimg": "img/hptile.png",
		"caption": "Dynamic Scalable Vector Graphic work <br> for HP OneView.",
		"contents": "<h2 class='focus_heading'>HP OneView</h2><hr class='focus_hr'/><p class='focus_paragraph'>During the 2014 summer I worked with the agile Embedded Fusion R&D team at Hewlett Packard to prototype a visually rich troubleshooting system for <a href='http://www8.hp.com/us/en/business-solutions/converged-systems/oneview.html' class='focus_link'>HP OneView</a>.</p> <img src='/img/svgZoom.png' class='focus_img' /><p class='focus_paragraph'>Using a RESTful API, I wrote a script that generated a dynamic Scalable Vector Graphic representation of a server enclosure. I also implemented a route parsing script that highlighted dysfunctional components as the image was drawn.</p>",
		"cache": "/img/svgZoom.png"
		},
	"tile2": {
		"tileimg": "img/pkmntile.png",
		"caption": "An Artificial Intelligence implementation for Pokémon Showdown.",
		"contents": "<h2 class='focus_heading'>The Pokémon Menace</h2><hr class='focus_hr'/><p class='focus_paragraph'><a href = 'https://github.com/taenin/the-pokemon-menace' class='focus_link'>The Pokémon Menace</a> is a project I created for my Artificial Intelligence Practicum at Cornell University. The project utilizes a modified implementation of Donald Michei's <i>Machine Educable Noughts And Crosses Engine (MENACE)</i> in an attempt to learn to play Pokémon from scratch. The bot can be accessed via an extension for Google Chrome that injects custom scripts into the page. These scripts parse console data into meaningful state representations for the knowledge base, allowing the bot to dyanamically react to situations as they arise. In its current iteration, the extension will only function on <a href='http://play.pokemonshowdown.com' class='focus_link'>Pokémon Showdown</a>.</p>",
		"cache": ""
		},
	"tile3": {
		"tileimg": "img/datatile.png",
		"caption": "Data driven SVG visualizations.",
		"contents": "<h2 class='focus_heading'>Data Driven Visualizations</h2><hr class='focus_hr'/><p class='focus_paragraph'>I worked with <a href = 'http://www.linkedin.com/pub/xiong-chu/80/654/50a' class='focus_link'>Xiong Chu</a> and <a href='http://www.linkedin.com/pub/mengxi-chi/57/2b4/23a' class='focus_link'>Chrissie Chi</a> to develop a prototype for visualizing data in the app <a href='http://idl.cornell.edu/projects/moodrhythm/' class='focus_link'>Mood Rhythm</a>. </p> <img src='/img/moodSnap.png' class='focus_img' /> <p class='focus_paragraph'><a href='/moodrhythm' class='focus_link'>Our interactive prototype</a> attempts to illustrates the connection between participants' feelings and their daily actions.</p> <p class='focus_paragraph'>I also worked with Xiong Chu on a <a href='/olympics' class='focus_link'>visualization of the 2014 Winter Olympics results</a> in which we draw attention to an interesting correlation between a country's GDP, average temperature, and medals earned.</p>",
		"cache": "/img/moodSnap.png"
		},
	"tile4": {
		"tileimg": "img/riottile.png",
		"caption": "Dynamic player stat tracking with a Python back-end.",
		"contents": "<h2 class='focus_heading'>League of Legends Death Tracker</h2><hr class='focus_hr'/><p class='focus_paragraph'>Using the Riot Games API I created a <a href='/riot' class='focus_link'>player death tracker</a> for the popular game League of Legends.</p><img src='/img/riotSnap.png' class='focus_img'/><p class='focus_paragraph'> The front-end of the app uses jQuery to request data from a local server and dynamically insert appropriate elements into the DOM. This process is run on a set interval, meaning the user can keep the app open and their stats will update without the need to refresh the page. The back-end consists of a multi-threaded python script that requests and parses data from the Riot API using a reasonable politeness policy.</p>",
		"cache": "/img/riotSnap.png"
		},
	"tile5": {
		"tileimg": "img/websitetile.png",
		"caption": "A scalable website design backed in Python.",
		"contents": "<h2 class='focus_heading'>This Website</h2><hr class='focus_hr'/><p class='focus_paragraph'>Built as a personal portfolio, this website uses a back-end based in <a href='http://www.pylonsproject.org/' class='focus_link'>Pyramid</a> to cache and serve all digital assets.<br>The front-end is constructed using jQuery and <a href='http://fortawesome.github.io/Font-Awesome/' class='focus_link'>Font Awesome</a> to create a responsive and scalable design.",
		"cache": ""
	}
	

}

